[    
    {
    "title" : "Jerry&#39;s Quest",
    "description": "Jerry&#39;s Quest is a 2D platformer I created in 5th grade using Scratch, where Jerry searches for a portal home with interactive sprites and a hidden cheat code.",
    "longDesc":"<p>The earliest project I worked on, Jerry&#39;s Quest (originally titled Foxy&#39;s Quest), is a 2D platformer where Jerry embarks on a journey to find a portal that will lead him home. I created this project in 5th grade as part of an after-school initiative led by a teacher to engage a small group of high-achieving and interested students in game design using Scratch, a block-based programming platform for animation, games, and design.</p> <p> In this class, we explored topics such as sprites, scenes, and simple conditional game logic, including using velocity along the y-axis to simulate gravity and enabling sprites to move and interact with the game world. One element I was particularly proud of was a cheat code hidden in the first level. If the sprite clips a corner and touches the pink, rose-colored blob, it will teleport the player to the penultimate level.</p> <p> In hindsight, it&#39;s easy to critique this project and identify areas for improvement, but at the time, it represented the best I could achieve with the resources and experience I had.</p> <p>It was incredibly fun to build as a fifth-grader! I encourage you to check it out if you&#39;d like.</p>",
    "image": "../Project_Display_Images/scratch/scratch.png",
    "technologies": ["Scratch"],
    "tags": ["Game Development", "Personal Project"],
    "date": "May 2015",
    "link":["https://scratch.mit.edu/projects/58211400/"]
    }, 
    {
        "title": "p5.js Watermelon",
        "description": "This project is a creative recreation of a watermelon using p5.js, developed during a CodeNext orientation to explore JavaScript fundamentals and creative coding techniques.",
        "longDesc":"This project is a simple yet creative recreation of a watermelon, developed during an orientation session for CodeNext. It served as an introduction to the p5.js library and coding in JavaScript, allowing me to explore foundational programming concepts and creative coding techniques.",
        "image": "../Project_Display_Images/p5js/watermelon_p5js.png",
        "technologies": ["p5.js", "JavaScript"],
        "tags": ["Art", "Code Next Project"],
        "date": "July 2018",
        "link":["https://editor.p5js.org/orvile@csedge.org/sketches/SyRpi0mVX"]
    },
    {
        "title": "p5.js Football Player",
        "description": "This p5.js project features a soccer player whose uniform changes with a spacebar press, developed during the CodeNext Foundations session.",
        "longDesc":"This p5.js illustration showcases a soccer player whose uniform kit changes with a press of the spacebar. The project was developed during the CodeNext Foundations session, where I gained exposure to new technologies and explored the fields of computer science and leadership. If I were to revisit this project, I would aim to incorporate more intricate details to enhance realism and bring the illustration to life.",
        "image": "../Project_Display_Images/p5js/football_player_p5js.png",
        "technologies": ["p5.js", "JavaScript"],
        "tags": ["Art", "Code Next Project"],
        "date": "July 2018",
        "link":["https://editor.p5js.org/orvile@csedge.org/sketches/SJS9II8N7"]
    },
    {
        "title": "p5.js Apple Animation",
        "description": "This p5.js animation features an apple with a leaf oscillating around its stem, created during the CodeNext Foundations session.",
        "longDesc":"<p>This p5.js animation features an apple with a leaf oscillating around its stem. The project was created during the CodeNext Foundations session.</p> <p> Important Note: This animation includes flashing imagery, which may not be suitable for individuals with photosensitive epilepsy.</p> <p>If I were to revisit this project, I would replace the random color generator with an array of solid colors. Additionally, I would implement smoother and more gradual color transitions to create a less intense visual experience for viewers.</p>",
        "image": "../Project_Display_Images/p5js/apple_p5js.png",
        "technologies": ["p5.js", "JavaScript"],
        "tags": ["Art", "Code Next Project"],
        "date": "August 2018",
        "link":["https://editor.p5js.org/orvile@csedge.org/sketches/SyZ91BAN7"]
    },
    {
        "title": "Rock Paper Scissors Android App",
        "description": "This Android implementation of Rock, Paper, Scissors, developed using Java and XML during the CodeNext Team Edge program, showcases my growth in Android app development and adaptability after overcoming a technical mishap to present at the 2019 Winter End-of-Term Showcase.",
        "longDesc":"<p>This project is an implementation of Rock, Paper, Scissors for Android, developed using XML and Java as part of my winter end-of-term project for CodeNext&#39;s Team Edge program. The first year of Team Edge focused on website development and computer science fundamentals, while the second year, which I was enrolled in, emphasized Android app development and applying those fundamentals in a new environment. </p> <p>Due to my efforts, I was honored to be one of two Team Edge members selected to present my project at the 2019 Winter End-of-Term Showcase.</p> <h5> Technical Overview </h5> <p>The app uses Java&#39;s Random class to simulate the CPU&#39;s choice. When the user selects an option, the background color of the corresponding button changes to a random color. A counter tracks the number of games won by the user versus the computer. This project marked an early stage in my Android development journey, where I was becoming familiar with the IDE, Java, XML, and the process of translating concepts into app functionality. </p> <h5>The Showcase Story </h5><p>A few days before the showcase, I met with one of the program coaches to confirm that everything was ready for my presentation. I uploaded my project files to GitHub, believing they would be preloaded onto a computer on the day of the event. Confident in my preparation, I arrived at the showcase and greeted the coaches and other attendees.</p> <p>Ten minutes before the event started, the coach asked me, \"You&#39;re all set to present, right? You have your computer with you?\" To my surprise, there had been a miscommunication—I was supposed to bring my laptop, but I didn&#39;t know this. My co-presenter, who was informed of this the day prior, had their setup ready to go. </p> <p>Though our implementations were similar in structure, my co-presenter had used different elements to represent \"Rock, Paper, and  Scissors,\" giving our apps distinct designs. While it would have been possible to present just their app, I was determined to showcase mine.</p> <p>Fortunately, I had experience with Android app development from a previous personal project I had worked on with a coach during Year 1 of Team Edge. Without hesitation, I asked my co-presenter, \"Can I borrow your computer?\" Logging into GitHub, I downloaded my project files—the XML file for the UI and the Java file that handled the game logic. </p> <p>With these files, I quickly integrated my app into theirs. I added a home screen with two buttons: one leading to their app and the other to mine. A few lines of code were all it took to implement the intent logic, which allowed the apps to function seamlessly as part of a single project. After testing the navigation and verifying that my app worked properly, I was ready to present. </p> <p>Despite the earlier hiccup, the presentation went smoothly. I engaged the audience by inviting participants to play against the computer in a best-of-three game. Although the audience team lost 1-2, the interaction was fun and lively.</p> <p>Afterward, the coach gave closing remarks, noting that we hadn&#39;t yet learned how to create apps with multiple screens, making my last-minute workaround an achievement in itself. This experience taught me the importance of preparation and adaptability, and I look back on it fondly as a valuable learning moment.</p> <p>Those were fun times! I hope not to run into the same issue again someday!</p>", 
        "image": "../Project_Display_Images/android_apps/android_rps.png",
        "technologies": ["Android", "Android Studio", "Java", "XML"],
        "tags": ["App Development", "Game Development", "Code Next Project"],
        "date": "December 2019",
        "link":["https://github.com/0rvil/rps"]
    },
    {
        "title": "Pet Plant Android App",
        "description": "The Pet Plant app, created for CodeNext's Team Edge Year 2, is a virtual plant care game where players nurture a plant through watering and fertilizing to trigger its evolution, using Android's timer and progress bar features for engaging gameplay.",
        "image": "../Project_Display_Images/android_apps/android_plant.png",
        "technologies": ["Android", "Android Studio", "Java", "XML"],
        "tags": ["App Development", "Code Next Project"],
        "date": "February 2020",
        "link":["https://github.com/0rvil/petApp"]
    },
    {
        "title": "Fitastic Android App",
        "description": "A fitness Android App that displays your steps, shows you the weather, and pulls healthy recipies.",
        "longDesc":"",
        "image": "../Project_Display_Images/android_apps/android_fitastic.png",
        "technologies": ["Android", "Android Studio", "Java", "XML"],
        "tags": ["App Development", "Code Next Project"],
        "date": "April 2020",
        "link":["https://github.com/0rvil/Team-Edge-Y2-T2"]
    },
    {
        "title": "Covid Tracker App",
        "description": "An Android App that uses a Covid-19 API to display Covid-19 data from a search query.",
        "longDesc":"",
        "image": "../Project_Display_Images/android_apps/android_covid_tracker.png",
        "technologies": ["Android", "Android Studio", "Java", "XML"],
        "tags": ["App Development", "Code Next Project"],
        "date": "April 2020",
        "link":["https://github.com/0rvil/COVIDTracker"]
    },
    {
        "title": "Star Wars Trivia Android App",
        "description": "My final capstone project for CodeNext Team Edge. ",
        "longDesc":"",
        "image": "../Project_Display_Images/android_apps/android_sw_trivia.png",
        "technologies": ["Android", "Android Studio", "Java", "XML", "Firebase", "Star Wars API (SWAPI)"],
        "tags": ["App Development", "Game Development", "Code Next Project"],
        "date": "July 2020",
        "link":["https://github.com/CodeNext-TeamEdgeY2/Star_Wars_Trivia"]
    },
    {
        "title": "DreamTime",
        "description": "DreamTime is an Android App for relaxation.",
        "longDesc":"",
        "image": "../Project_Display_Images/android_apps/android_dreamtime.png",
        "technologies": ["Android", "Android Studio", "Java", "XML", "Firebase"],
        "tags": ["App Development", "Code Next Project"],
        "date": "July 2020",
        "link":["https://github.com/0rvil/DreamTime"]
    },
    {
        "title": "iOS Club - Project 1",
        "description": "An iOS app that displays a list and contains images.",
        "longDesc":"",
        "image": "../Project_Display_Images/iOS_apps/ios_project_1.png",
        "technologies": ["iOS", "Xcode", "Swift"],
        "tags": ["App Development", "Code Next Project"],
        "date": "April 2020",
        "link":["https://github.com/0rvil/iOS-Club-Project1"]
    },
    {
        "title": "iOS Club - Project 2",
        "description": "An iOS app where you guess the flag.",
        "longDesc":"",
        "image": "../Project_Display_Images/iOS_apps/ios_project_2.png",
        "technologies": ["iOS", "Xcode", "Swift"],
        "tags": ["App Development", "Game Development", "Code Next Project"],
        "date": "May 2020",
        "link":["https://github.com/0rvil/iOS-Club-Project2"]
    },
    {
        "title": "iOS Club - Project 4",
        "description": "An iOS app made for iPads where your spaceship aims to avoid obstacles.",
        "longDesc":"",
        "image": "../Project_Display_Images/iOS_apps/ios_project_4.png",
        "technologies": ["iOS", "Xcode", "Swift"],
        "tags": ["App Development", "Game Development", "Code Next Project"],
        "date": "June 2020",
        "link":["https://github.com/0rvil/iOS-Club-Project-4"]
    },
    {
        "title": "React Todo List",
        "description": "A todo list built with react as part of the CodeNext React workshop.",
        "longDesc":"",
        "image": "../Project_Display_Images/react/todo_list.png",
        "technologies": ["React", "JavaScript"],
        "tags": ["Web Development", "Code Next Project"],
        "date": "February 2022",
        "link":["https://code-next-react-todo-skeleton-jexjox.stackblitz.io/"]
    },
    {
        "title": "Fruit and GameStop Dashboard",
        "description": "A dashboard displaying fruit data from a pseudo data set and real data from GameStop stock, made at the CodeNext Data Analytics in Python with Flask workshop.",
        "longDesc":"",
        "image": "../Project_Display_Images/flask_dashboards/fruit_x_gme_dashboard.png",
        "technologies": ["Python", "Flask"],
        "tags": ["Code Next Project"],
        "date": "March 2021",
        "link":["https://github.com/0rvil/CodeNext-Visualizing-Data-With-Flask"]
    },
    {
        "title": "Hopper Game",
        "description": "An implementation of the hopper game made at the CodeNext Game Dev workshop.",
        "longDesc":"",
        "image": "../Project_Display_Images/hopper/hopper.png",
        "technologies": ["JavaScript"],
        "tags": ["Game Development", "Code Next Project"],
        "date": "March 2021",
        "link":["https://replit.com/@OrvilEscalante/CodeNext-Game-Dev-Workshop"]
    },
    {
        "title": "Spider-Man Key Chain",
        "description": "A Spider-man engraved keychain made at the CodeNext Laser Cutting club",
        "longDesc":"",
        "image": "../Project_Display_Images/laser_cutting/spider-man_keychain.png",
        "technologies": ["Laser Cutting", "LibreOffice"],
        "tags": ["Art", "Code Next Project"],
        "date": "May 2022",
        "link":["https://drive.google.com/file/d/1Y4B2lIBfL30z0hkFg-lXJnjOVj3vDlz1/view?usp=sharing"]
    },
    {
        "title": "Living Hinge Prototype",
        "description": "A living hinge made at the CodeNext Laser Cutting club. For this project alternating sets of small parallel lines are laser cut to give the piece of wood a bending effect, much like a hinge",
        "longDesc":"",
        "image": "../Project_Display_Images/laser_cutting/living_hinge.png",
        "technologies": ["Laser Cutting", "LibreOffice"],
        "tags": ["Art", "Code Next Project"],
        "date": "May 2022",
        "link":["https://drive.google.com/file/d/1dDRlpjHX8BwiUZbsNvJpd1mqsVKSFACi/view?usp=sharing"]
    },
    {
        "title": "React Wordle",
        "description": "A Wordle project built with react and react-dom made at the CodeNext React club",
        "longDesc":"",
        "image": "../Project_Display_Images/react/wordle.png",
        "technologies": ["React", "JavaScript"],
        "tags": ["Game Development", "Code Next Project"],
        "date": "June 2022",
        "link":["https://stackblitz.com/edit/wordle-codenext-orvil?file=src%2FApp.js"]
    },
    {
        "title": "Rock Paper Scissors iOS App",
        "description": "My 2020 Independent project for CodeNext: Rock Paper Scissors iOS app made with Swift and XCode.",
        "longDesc":"",
        "image": "../Project_Display_Images/iOS_apps/ios_rps.png",
        "technologies": ["iOS", "Xcode", "Swift"],
        "tags": ["App Development", "Game Development"],
        "date": "June 2020",
        "link":["https://github.com/0rvil/iOS-Rock-Paper-Scissors"]
    },
    {
        "title": "Dog Animation",
        "description": "A dog animation made for the DreamTime app using Adobe Illustrator and Adobe After Effects",
        "longDesc":"",
        "image": "../Project_Display_Images/adobe_animations/dog_animation.png",
        "technologies": ["Adobe After Effects", "Adobe Illustrator"],
        "tags": ["Art", "Personal Project"],
        "date": "May 2019",
        "link":["https://www.youtube.com/shorts/_tTEOl879N4"]
    },
    {
        "title": "Owl Animation",
        "description": "An owl animation that was intended to serve as the splash screen for the DreamTime app. Didn't quite make the final cut and went unused.",
        "longDesc":"",
        "image": "../Project_Display_Images/adobe_animations/owl_animation.png",
        "technologies": ["Adobe After Effects", "Adobe Illustrator"],
        "tags": ["Art", "Personal Project"],
        "date": "April 2019",
        "link":["https://drive.google.com/file/d/1lJP_uVm65eaTiEz8G3Xy55y-r4CuVLkJ/view?usp=sharing"]
    },
    {
        "title": "Flutter Movie Finder App",
        "description": "The 2021 Independent project for CodeNext is a movie finder app built with Flutter, Flask, TMDB API, and Google Cloud App Engine, allowing users to search for movies on both iOS and Android platforms.",
        "longDesc":"My 2021 Independent project for CodeNext: A movie finder app made with Flutter, Flask, TMDB API, Google Cloud App Engine. The app makes calls to a flask server, hosted on Google Cloud App Engine, which makes API calls to TMDB. The app was made in Flutter which allows users to engage on iOS and Android platforms. A special thanks to my mentor Imad Karriaper, who provided me with unwavering support throughout the process!",
        "image": "../Project_Display_Images/flutter/movie_finder_app.png",
        "technologies": ["Flutter", "Dart", "Android Studio", "Xcode"],
        "tags": ["Featured"],
        "date": "June 2021",
        "link":["https://github.com/0rvil/movie_finder"]
    },
    {
        "title": "CIFAR-10 Convolutional Neural Network (CNN)",
        "description": "My 2022 Independent project for CodeNext is a CIFAR-10 image classifier, a machine learning model that categorizes images into 10 distinct classes.",
        "longDesc":"My 2022 and final Independent project for CodeNext: CIFAR 10 Image classifier. This project is a Machine Learning Model that classifies images from 10 categories. A special thanks to R.E Wolfe who helped me tremendously throughout the process!",
        "image": "../Project_Display_Images/machine_learning/cifar_10_cnn.png",
        "technologies": ["Python", "TensorFlow", "Numpy", "Keras", "Matplotlib", "CNN"],
        "tags": ["Featured", "AI & Machine Learning", "Professional Project"],
        "date": "June 2022",
        "link":["https://colab.research.google.com/drive/1Rnw2PAXdiBfoe3ISLPx58qlWwZVfg4pO#scrollTo=ufLMQ1W3r3Io"]
    },
    {
        "title": "MNIST - Digit Classifier",
        "description": "Utilized the MNIST dataset to create a digit classifier that achieved a 98% accuracy",
        "longDesc":"",
        "image": "../Project_Display_Images/machine_learning/digit_classifier.png",
        "technologies": ["Python", "Numpy", "TensorFlow", "Keras", "Matplotlib"],
        "tags": ["AI & Machine Learning", "Professional Project"],
        "date": "March 2022",
        "link":["https://colab.research.google.com/drive/1Ei8L5-vh8QEYQhr_YeMoRbb_ZFR3OHjl"]
    },
    {
        "title": "Alphaword",
        "description": "AlphaWord is a Java-based word-guessing game inspired by Wordle, featuring three categories: Classic, Themed Collections, and Tower of Lexicon, offering varied challenges for players to enjoy.",
        "longDesc":"Welcome to AlphaWord, a word-guessing game inspired by the New York Times classic, Wordle, originally created by Josh Wardle. This Java-based Processing application offers players three engaging categories to choose from: Classic, Themed Collections, and Tower of Lexicon. Classic: The game as you know it. Get 6 chances to guess a 5-letter word. Themed Collections: Guess the five letter word based on the theme. There are 3 themes to choose from summer, autumn, and winter. Tower of Lexicon: Lexicon has been trapped in a tower. Can you beat all 10 levels and reach the top?Be careful, the further up you go the harder it gets!",
        "image": "../Project_Display_Images/processing/alphaword.png",
        "technologies": ["Processing", "Java"],
        "tags": ["Featured", "Game Development", "Professional Project"],
        "date": "December 2023",
        "link":["https://github.com/0rvil/AlphaWord_Processing_Final_Project_CSCI_1423"]
    },
    {
        "title": "Stop Light Arduino",
        "description": "Arduino circuit that uses the ultrasonic sensor to detect whether an object is within close, medium, or far range. ",
        "longDesc":"",
        "image": "../Project_Display_Images/arduino/stop_light_arduino.png",
        "technologies": ["Arduino", "Java"],
        "tags": ["Hardware"],
        "date": "November 2023",
        "link":["https://youtu.be/PHyEdbZoqfw"]
    },
    {
        "title": "Arduino LCD Temperature and Humidity",
        "description": "Arduino circuit that uses the LCD, 16 x 2, to display the temperature and humidity of a room based on the sensors.",
        "longDesc":"",
        "image": "../Project_Display_Images/arduino/temperature_and_humidity_arduino.png",
        "technologies": ["Arduino", "Java"],
        "tags": ["Hardware"],
        "date": "November 2023",
        "link":["https://youtu.be/YW8uzGvs3aA"]
    },
    {
        "title": "Spooky Arduino LCD",
        "description": "Arduino circuit that uses the LCD, 16 x 2, to display an alternate Halloween message when the button is pressed.",
        "longDesc":"",
        "image": "../Project_Display_Images/arduino/spooky_lcd_arduino.png",
        "technologies": ["Arduino", "Java"],
        "tags": ["Hardware"],
        "date": "October 2023",
        "link":["https://youtu.be/lwAyIesu7Tg"]
    },
    {
        "title": "Kindergarten Database",
        "description": "Kindergarten relational database system that has a Database Schema, ER diagram, and implementation with SQL and SQL WorkBench.",
        "longDesc":"",
        "image": "../Project_Display_Images/kindergarten/kindergarten_database.png",
        "technologies": ["SQL", "mySQL WorkBench"],
        "tags": ["Featured", "Professional Project"],
        "date": "August 2024",
        "link":["#"]
    },
    {
        "title": "Student Test Portal",
        "description": "A computer science test platform that pulls from a bank of 100+ questions and integrates the Gemini API to generate new questions, allowing instructors to manage students, view test reports, and create or add new questions.",
        "longDesc":"Administers students a computer science test that pulls from a bank of over 100+ questions. Also utilizes the Gemini API to make requests to generate new questions with their corresponding answers to add to the test bank. Instructors are able to view reports from the students that have taken the test, add new students into the system, and create new test questions from scratch or the Gemini LLM API. ",
        "image": "Project_Display_Images/test_portal/student_test_portal.png",
        "technologies": ["Java", "Gemini API"],
        "tags": ["Featured", "Professional Project"],
        "date": "May 2024",
        "link":["#"]
    },
    {
        "title": "Lifelet",
        "description": "Lifelet is an online bullet journaling system that won 1st place in the CodeNext 2020 Hackathon website category, allowing users to take notes, track progress, and build community, my contribution for this project was on creating the trackers webpage.",
        "longDesc":"A CodeNext 2020 Hacakthon, 1st place winner of the website category. Lifelet is an online bullet journaling system meant to offer users a way to capture their information in bullet point lists. The website offers users the opportunity to take notes, track their progress, and create community. The hackathon took place over the course of one weekend (Friday-Sunday) and was held virtually. I was in charge of the trackers and creating the trackers webpage.",
        "image": "Project_Display_Images/lifelet/lifelet.png",
        "technologies": ["JavaScript", "HTML", "CSS"],
        "tags": ["Web Development", "Code Next Project"],
        "date": "June 2020",
        "link":["https://glitch.com/edit/#!/team3hackathon2020?path=index.html%3A1%3A0"]
    },
    {
        "title": "Fifa 20 Player Rating Machine Learning Classifier",
        "description": "Final project for CodeNext Machine Learning Club. Applied linear regression, decision trees, neural networks, and K-Nearest neighboors to the Fifa 20 player dataset in an effort to classiifer a player profile its in game rating. ",
        "longDesc":"",
        "image": "../Project_Display_Images/machine_learning/fifa_classifier.png",
        "technologies": ["Python", "Sklearn", "Pandas", "Numpy"],
        "tags": ["AI & Machine Learning", "Code Next Project"],
        "date": "February 2021",
        "link":["https://colab.research.google.com/drive/1-b7C6BF8Sy9VoGHj5spG_hh6kTFnLFKP"]
    },
    {
        "title": "Instacart Order Clustering",
        "description": "Leveraged algorithms such as KMeans, DBSCAN, and Word2Vec to cluster customer transactions and products.",
        "longDesc":"Led a team in applying clustering and analysis techniques to a large Instacart dataset of 3,421,083 transactions and 206,209 customers. Leveraged KMeans, DBSCAN, and Word2Vec algorithms on product and customer transaction data to reveal product associations and customer purchasing patterns. Used Python with libraries including pandas, numpy, matplotlib, scipy.stats, squarify, and sklearn.",
        "image": "../Project_Display_Images/machine_learning/instacart_product_clustering.png",
        "technologies": ["Python", "Keras", "Matplotlib", "Numpy", "DBSCAN", "Word2Vec"],
        "tags": ["Featured", "AI & Machine Learning", "Professional Project"],
        "date": "Current",
        "link":["https://colab.research.google.com/drive/1VKx6gRjc6d1NtPg1PKcxVotdiM6pYTUX?authuser=1#scrollTo=tyIUQ192nHW5"]
    },
    {
        "title": "Winnie the Pooh Animation",
        "description": "My first Procreate Animation, featuring Winnie the Pooh.",
        "longDesc":"<p>Pooh is off to search for honey 🍯! A personal project where I created a simple animation of Winnie the Pooh floating upwards with some balloons on Procreate.</p> <p> I created this animation by editing each frame. In total there are 17 frames, which are animated in 6 frames per second.</p> <p> In the future I would like to add a background that aligns with the setting of the Hundred Acre Wood. This was my first attempt at animating with Procreate. I like how it turned out!</p>",
        "image": "../Project_Display_Images/procreate/winnie_the_pooh_animation.jpeg",
        "technologies": ["Procreate"],
        "tags": ["Art", "Personal Project"],
        "date": "September 2024",
        "link":["https://youtube.com/shorts/7Cd3jeTOIiI?feature=shared"]
    }

]

